{
  "irVersion": "1.0",
  "project": "incident-lifecycle-spec",
  "repository": "https://github.com/plexusone/incident-lifecycle-spec",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-05-09",
      "highlights": [
        { "description": "D2 diagram visualization for hypothesis lifecycle and timeline" },
        { "description": "`ilspec visualize` command for generating D2/SVG diagrams" },
        { "description": "`--diagrams` flag to embed D2 code blocks in rendered Markdown" }
      ],
      "added": [
        { "description": "`pkg/visualize` package for D2 diagram generation using d2vision", "commit": "d8ca3d6" },
        { "description": "`ilspec visualize` command with `--type hypothesis|timeline|all` and `--format d2|svg`", "commit": "493cd45" },
        { "description": "`--diagrams` flag for `ilspec render` to embed D2 code blocks", "commit": "7b7a78c" },
        { "description": "Hypothesis lifecycle diagram showing state transitions (proposed → investigating → validated)", "commit": "d8ca3d6" },
        { "description": "Timeline diagram with evidence links and event source shapes", "commit": "d8ca3d6" }
      ],
      "tests": [
        { "description": "Unit tests for visualize package: diagram generation, rendering", "commit": "d8ca3d6" }
      ],
      "dependencies": [
        { "description": "github.com/grokify/d2vision for D2 code generation and SVG rendering", "commit": "7b7a78c" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-05-09",
      "highlights": [
        { "description": "`ilspec init` command for scaffolding new incidents with phase-aware templates" },
        { "description": "JSON Schema runtime validation with embedded schema" },
        { "description": "`ilspec validate` command for validating incident JSON files" },
        { "description": "Premortem template for proactive failure simulation" }
      ],
      "added": [
        { "description": "`ilspec init` command with phase-aware templates and auto-generated IDs", "commit": "0348569" },
        { "description": "JSON Schema runtime validation using santhosh-tekuri/jsonschema", "commit": "932f397" },
        { "description": "`--schema-only` flag for JSON Schema validation only", "commit": "932f397" },
        { "description": "`ilspec validate` command with required field and enum validation", "commit": "b0b49ce" },
        { "description": "Premortem Markdown template with failure scenarios, early warning signals, and mitigations", "commit": "ce47e86" },
        { "description": "`RenderPremortem()` method in render package", "commit": "ce47e86" }
      ],
      "tests": [
        { "description": "Unit tests for validate command: required fields, enums, nested structures", "commit": "c1aa0c1" },
        { "description": "Unit tests for schema package: validator creation, validation methods", "commit": "c1aa0c1" },
        { "description": "Unit tests for types package: JSON round-trip, enum values", "commit": "75beb63" },
        { "description": "Unit tests for render package: template rendering, view helpers", "commit": "75beb63" }
      ],
      "documentation": [
        { "description": "Premortem example JSON for proactive failure simulation", "commit": "471b732" },
        { "description": "Postmortem example JSON for full incident analysis", "commit": "471b732" },
        { "description": "README updated with validate command usage", "commit": "7d6b397" }
      ],
      "build": [
        { "description": "GoReleaser configuration for cross-platform binary releases", "commit": "1521fca" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-05-09",
      "commit": "547a54a",
      "highlights": [
        { "description": "Unified incident lifecycle schema spanning premortem, intra-mortem, and postmortem phases" },
        { "description": "CLI tool for rendering incident JSON to Markdown with phase-aware template selection" }
      ],
      "added": [
        { "description": "JSON Schema for incident lifecycle artifacts with timeline, hypotheses, action items, and evidence", "commit": "4c828b7" },
        { "description": "Go types matching schema with type-safe enums for phase, severity, status, and confidence levels", "commit": "47ad817" },
        { "description": "Markdown renderer with embedded templates for intra-mortem and postmortem phases", "commit": "cb201a4" },
        { "description": "View helpers: `ConfirmedFacts()`, `ActiveHypotheses()`, `InProgressActions()` for template filtering", "commit": "cb201a4" },
        { "description": "`ilspec render` command with auto-detection of template based on incident phase", "commit": "e918402" },
        { "description": "Auto-generated output filenames based on phase (e.g., `incident-update.md` for intra-mortem)", "commit": "b7eafac" },
        { "description": "`--output` flag for explicit output file, use `-` for stdout", "commit": "b7eafac" },
        { "description": "`--template-dir` flag for custom template directories", "commit": "e918402" }
      ],
      "documentation": [
        { "description": "README with lifecycle model explanation, architecture diagram, and usage instructions", "commit": "99a1ea2" },
        { "description": "DESIGN_PRINCIPLES covering schema navigability, nesting limits, and schemakit integration", "commit": "99a1ea2" },
        { "description": "Example intra-mortem incident JSON demonstrating schema usage", "commit": "7bda137" }
      ],
      "internal": [
        { "description": "Go module initialization with cobra dependency", "commit": "547a54a" }
      ]
    }
  ]
}
